Applying **qcon-demo-org**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.terraform_repo2.github_branch_protection_v3.branch_protection will be created
+   resource "github_branch_protection_v3" "branch_protection" {
+       branch                          = "main"
+       enforce_admins                  = true
+       etag                            = (known after apply)
+       id                              = (known after apply)
+       repository                      = "repo2"
+       require_conversation_resolution = false
+       require_signed_commits          = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = true
+           required_approving_review_count = 1
        }
    }

  # module.terraform_repo2.github_repository.github_repo will be created
+   resource "github_repository" "github_repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = false
+       description                 = "Test repo2"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "repo2"
+       node_id                     = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       visibility                  = (known after apply)

+       security_and_analysis {
+           advanced_security {
+               status = (known after apply)
            }

+           secret_scanning {
+               status = (known after apply)
            }

+           secret_scanning_push_protection {
+               status = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

```
module.terraform_repo2.github_repository.github_repo: Creating...
module.terraform_repo2.github_repository.github_repo: Creation complete after 4s [id=repo2]
module.terraform_repo2.github_branch_protection_v3.branch_protection: Creating...
module.terraform_repo2.github_branch_protection_v3.branch_protection: Creation complete after 2s [id=repo2:main]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```